# FSObject

## Description
Function FSObject returns the handle to the first selected object in the referenced layer. If no objects are selected, the function returns NIL.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION FSObject(h : HANDLE) : HANDLE;
```

```python

def vs.FSObject(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling